       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_WORLD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 FOO PIC 99 VALUE 43.
       PROCEDURE DIVISION.
           DISPLAY "Hello, World!" FOO
           STOP RUN.
